src/Documents/ОтработанноеВремя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтработанноеВремя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РН_ОтработанноеВремя</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/РН_ОтработанноеВремя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РН_ОтработанноеВремя</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ОтработанноеВремя/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РН_ОтработанноеВремя Приход
	Движения.РН_ОтработанноеВремя.Записывать = Истина;
	Движение = Движения.РН_ОтработанноеВремя.Добавить();
	Движение.ВидДвижения = ?(Операция,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Часы = Часы;    
	
	Если Операция Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РН_ОтработанноеВремяОстатки.ЧасыОстаток КАК ЧасыОстаток,
		|	РН_ОтработанноеВремяОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.РН_ОтработанноеВремя.Остатки(&ДатаЗапроса, Сотрудник = &Сотрудник) КАК РН_ОтработанноеВремяОстатки";
		
		Запрос.УстановитьПараметр("ДатаЗапроса", МоментВремени());
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если (ВыборкаДетальныеЗаписи.ЧасыОстаток-Часы)<0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Остаток Часов: "+(ВыборкаДетальныеЗаписи.ЧасыОстаток),,,,Отказ);			
			КонецЕсли;			
		КонецЕсли;   
		
	КонецЕсли;
	
	
КонецПроцедуры
